//Задача 1
// Console.Write("Введите число: ");
// int number = int.Parse(Console.ReadLine());
// Console.WriteLine($"Квадрат {number} равен {number*number}");

// string name = Console.ReadLine(); //Ввод имени
// Console.WriteLine("Ваше имя: "+name); // Вывод имени

//Задача 2